var data = [];
var dataStr = '0、霍比特人3<br>\
<br>\
导演：彼得·杰克逊0<br>\
编剧：弗兰·威尔士 / 费丽帕·鲍恩斯 / <br>\
主演：马丁·费瑞曼 / 伊恩·麦克莱恩<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
1、心花怒放<br>\
<br>\
导演：彼得·杰克逊1<br>\
编剧：弗兰·威尔士 / 费丽帕·鲍恩斯 / <br>\
主演：马丁·费瑞曼 / 伊恩·麦克莱恩<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
2、钢铁力士<br>\
<br>\
导演：彼得·杰克逊2<br>\
编剧：弗兰·威尔士 / 费丽帕·鲍恩斯 / <br>\
主演：马丁·费瑞曼 / 伊恩·麦克莱恩<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
3、一万年以后<br>\
<br>\
导演：彼得·杰克逊2<br>\
编剧：弗兰·威尔士 / 费丽帕·鲍恩斯 / <br>\
主演：马丁·费瑞曼 / 伊恩·麦克莱恩<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
4、冰封之重生之门<br>\
<br>\
导演：彼得·杰克逊2<br>\
编剧：弗兰·威尔士 / 费丽帕·鲍恩斯 / <br>\
主演：马丁·费瑞曼 / 伊恩·麦克莱恩<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
5、铜雀台<br>\
<br>\
导演：彼得·杰克逊2<br>\
编剧：弗兰·威尔士 / 费丽帕·鲍恩斯 / <br>\
主演：马丁·费瑞曼 / 伊恩·麦克莱恩<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
6、大明劫<br>\
<br>\
导演：彼得·杰克逊2<br>\
编剧：弗兰·威尔士 / 费丽帕·鲍恩斯 / <br>\
主演：马丁·费瑞曼 / 伊恩·麦克莱恩<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
7、APAP<br>\
<br>\
导演：彼得·杰克逊2<br>\
编剧：弗兰·威尔士 / 费丽帕·鲍恩斯 / <br>\
主演：马丁·费瑞曼 / 伊恩·麦克莱恩<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
8、云图<br>\
<br>\
导演：彼得·杰克逊2<br>\
编剧：弗兰·威尔士 / 费丽帕·鲍恩斯 / <br>\
主演：马丁·费瑞曼 / 伊恩·麦克莱恩<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
9、复仇者联盟<br>\
<br>\
导演：彼得·杰克逊2<br>\
编剧：弗兰·威尔士 / 费丽帕·鲍恩斯 / <br>\
主演：马丁·费瑞曼 / 伊恩·麦克莱恩<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
10、毒战<br>\
<br>\
导演：彼得·杰克逊2<br>\
编剧：弗兰·威尔士 / 费丽帕·鲍恩斯 / <br>\
主演：马丁·费瑞曼 / 伊恩·麦克莱恩<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
11、别有动机<br>\
<br>\
导演：彼得·杰克逊2<br>\
编剧：弗兰·威尔士 / 费丽帕·鲍恩斯 / <br>\
主演：马丁·费瑞曼 / 伊恩·麦克莱恩<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
12、风暴<br>\
<br>\
导演：彼得·杰克逊2<br>\
编剧：弗兰·威尔士 / 费丽帕·鲍恩斯 / <br>\
主演：马丁·费瑞曼 / 伊恩·麦克莱恩<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
13、林中小屋<br>\
<br>\
导演：彼得·杰克逊2<br>\
编剧：弗兰·威尔士 / 费丽帕·鲍恩斯 / <br>\
主演：马丁·费瑞曼 / 伊恩·麦克莱恩<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
14、甜心巧克力<br>\
<br>\
导演：彼得·杰克逊2<br>\
编剧：弗兰·威尔士 / 费丽帕·鲍恩斯 / <br>\
主演：马丁·费瑞曼 / 伊恩·麦克莱恩<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
15、卧虎<br>\
<br>\
导演：彼得·杰克逊2<br>\
编剧：弗兰·威尔士 / 费丽帕·鲍恩斯 / <br>\
主演：马丁·费瑞曼 / 伊恩·麦克莱恩<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
16、全民目击<br>\
<br>\
导演：彼得·杰克逊2<br>\
编剧：弗兰·威尔士 / 费丽帕·鲍恩斯 / <br>\
主演：马丁·费瑞曼 / 伊恩·麦克莱恩<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
17、THE OTHER BOLEYN GIRL<br>\
<br>\
导演：彼得·杰克逊2<br>\
编剧：弗兰·威尔士 / 费丽帕·鲍恩斯 / <br>\
主演：马丁·费瑞曼 / 伊恩·麦克莱恩<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
18、冬萌功2拳霸天下<br>\
<br>\
导演：彼得·杰克逊2<br>\
编剧：弗兰·威尔士 / 费丽帕·鲍恩斯 / <br>\
主演：马丁·费瑞曼 / 伊恩·麦克莱恩<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
<br>\
<br>\
19、太极<br>\
<br>\
导演：彼得·杰克逊2<br>\
编剧：弗兰·威尔士 / 费丽帕·鲍恩斯 / <br>\
主演：马丁·费瑞曼 / 伊恩·麦克莱恩<br>\
类型：动作 / 奇幻 / 冒险<br>\
制片国家/地区：美国 / 新西兰<br>\
语言：英语<br>\
上映日期：2015-01-23(中国大陆) / 2014-12-17(美国)<br>\
片长：144分钟<br>\
';

var d = dataStr.split('<br><br><br>');
for(var i=0;i<d.length;i++){
	var c = d[i].split('<br><br>');
	data.push({
		img:c[0].replace('、',' ')+'.jpg',
		caption:c[0].split('、')[1],
		desc:c[1]
	});
}